<a href="https://colab.research.google.com/github/divsal009/div/blob/master/Pandas.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

Pandas packages is used to read various data forms (csv, json, excel etc.) & converts in into DataFrame (DF is excel like 2D data representation of N-D Array)

In [1]:
import pandas as pd

In [2]:
titanic_df = pd.read_csv('https://raw.githubusercontent.com/ammishra08/MachineLearning/master/Datasets/Titanic_Data.csv', sep = ',')

In [3]:
titanic_df

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [4]:
titanic_df.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [5]:
titanic_df.tail()

     PassengerId  Survived  Pclass  ...   Fare Cabin  Embarked
886          887         0       2  ...  13.00   NaN         S
887          888         1       1  ...  30.00   B42         S
888          889         0       3  ...  23.45   NaN         S
889          890         1       1  ...  30.00  C148         C
890          891         0       3  ...   7.75   NaN         Q

[5 rows x 12 columns]

In [6]:
titanic_df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [7]:
titanic_df.shape

(891, 12)

In [8]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

**Missing Values**

In [9]:
# is null returns true for missing values & false for not missing
titanic_df.isnull()

     PassengerId  Survived  Pclass   Name  ...  Ticket   Fare  Cabin  Embarked
0          False     False   False  False  ...   False  False   True     False
1          False     False   False  False  ...   False  False  False     False
2          False     False   False  False  ...   False  False   True     False
3          False     False   False  False  ...   False  False  False     False
4          False     False   False  False  ...   False  False   True     False
..           ...       ...     ...    ...  ...     ...    ...    ...       ...
886        False     False   False  False  ...   False  False   True     False
887        False     False   False  False  ...   False  False  False     False
888        False     False   False  False  ...   False  False   True     False
889        False     False   False  False  ...   False  False  False     False
890        False     False   False  False  ...   False  False   True     False

[891 rows x 12 columns]

In [10]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [12]:
titanic_df.isnull().sum().sort_values()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
Age            177
Cabin          687
dtype: int64

**DATA MANIPULATION**

In [14]:
titanic_df.loc[:,:]

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
1              2         1       1  ...  71.2833   C85         C
2              3         1       3  ...   7.9250   NaN         S
3              4         1       1  ...  53.1000  C123         S
4              5         0       3  ...   8.0500   NaN         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[891 rows x 12 columns]

In [16]:
titanic_df.loc[1:500]

     PassengerId  Survived  Pclass  ...      Fare    Cabin  Embarked
1              2         1       1  ...   71.2833      C85         C
2              3         1       3  ...    7.9250      NaN         S
3              4         1       1  ...   53.1000     C123         S
4              5         0       3  ...    8.0500      NaN         S
5              6         0       3  ...    8.4583      NaN         Q
..           ...       ...     ...  ...       ...      ...       ...
496          497         1       1  ...   78.2667      D20         C
497          498         0       3  ...   15.1000      NaN         S
498          499         0       1  ...  151.5500  C22 C26         S
499          500         0       3  ...    7.7958      NaN         S
500          501         0       3  ...    8.6625      NaN         S

[500 rows x 12 columns]

In [18]:
titanic_df.loc[1:500,['Age','Fare']]

      Age      Fare
1    38.0   71.2833
2    26.0    7.9250
3    35.0   53.1000
4    35.0    8.0500
5     NaN    8.4583
..    ...       ...
496  54.0   78.2667
497   NaN   15.1000
498  25.0  151.5500
499  24.0    7.7958
500  17.0    8.6625

[500 rows x 2 columns]

In [19]:
titanic_df.loc[:500,['Age','Fare']]

      Age      Fare
0    22.0    7.2500
1    38.0   71.2833
2    26.0    7.9250
3    35.0   53.1000
4    35.0    8.0500
..    ...       ...
496  54.0   78.2667
497   NaN   15.1000
498  25.0  151.5500
499  24.0    7.7958
500  17.0    8.6625

[501 rows x 2 columns]

 **iloc read from index positions** data read from start to n-1 **bold text**

In [20]:
titanic_df.iloc[1:502,1:6]

     Survived  Pclass  ...     Sex   Age
1           1       1  ...  female  38.0
2           1       3  ...  female  26.0
3           1       1  ...  female  35.0
4           0       3  ...    male  35.0
5           0       3  ...    male   NaN
..        ...     ...  ...     ...   ...
497         0       3  ...    male   NaN
498         0       1  ...  female  25.0
499         0       3  ...    male  24.0
500         0       3  ...    male  17.0
501         0       3  ...  female  21.0

[501 rows x 5 columns]

In [22]:
titanic_df.iloc[:,-1]

0      S
1      C
2      S
3      S
4      S
      ..
886    S
887    S
888    S
889    C
890    Q
Name: Embarked, Length: 891, dtype: object

In [24]:
titanic_df.iloc[:,:-1]

     PassengerId  Survived  Pclass  ...            Ticket     Fare  Cabin
0              1         0       3  ...         A/5 21171   7.2500    NaN
1              2         1       1  ...          PC 17599  71.2833    C85
2              3         1       3  ...  STON/O2. 3101282   7.9250    NaN
3              4         1       1  ...            113803  53.1000   C123
4              5         0       3  ...            373450   8.0500    NaN
..           ...       ...     ...  ...               ...      ...    ...
886          887         0       2  ...            211536  13.0000    NaN
887          888         1       1  ...            112053  30.0000    B42
888          889         0       3  ...        W./C. 6607  23.4500    NaN
889          890         1       1  ...            111369  30.0000   C148
890          891         0       3  ...            370376   7.7500    NaN

[891 rows x 11 columns]

In [23]:
titanic_df.iloc[:,-4:]

               Ticket     Fare Cabin Embarked
0           A/5 21171   7.2500   NaN        S
1            PC 17599  71.2833   C85        C
2    STON/O2. 3101282   7.9250   NaN        S
3              113803  53.1000  C123        S
4              373450   8.0500   NaN        S
..                ...      ...   ...      ...
886            211536  13.0000   NaN        S
887            112053  30.0000   B42        S
888        W./C. 6607  23.4500   NaN        S
889            111369  30.0000  C148        C
890            370376   7.7500   NaN        Q

[891 rows x 4 columns]

**drop rows and colms**

In [ ]:
#axis=0 row wise

In [25]:
titanic_df.drop([1,2,3,4,5,6],axis=0)

     PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0              1         0       3  ...   7.2500   NaN         S
7              8         0       3  ...  21.0750   NaN         S
8              9         1       3  ...  11.1333   NaN         S
9             10         1       2  ...  30.0708   NaN         C
10            11         1       3  ...  16.7000    G6         S
..           ...       ...     ...  ...      ...   ...       ...
886          887         0       2  ...  13.0000   NaN         S
887          888         1       1  ...  30.0000   B42         S
888          889         0       3  ...  23.4500   NaN         S
889          890         1       1  ...  30.0000  C148         C
890          891         0       3  ...   7.7500   NaN         Q

[885 rows x 12 columns]

In [ ]:
titanic_df.drop([1,2,3,4,5,6],axis=0)

In [27]:
titanic_df.drop('Name',axis=1)

     PassengerId  Survived  Pclass  ...     Fare  Cabin  Embarked
0              1         0       3  ...   7.2500    NaN         S
1              2         1       1  ...  71.2833    C85         C
2              3         1       3  ...   7.9250    NaN         S
3              4         1       1  ...  53.1000   C123         S
4              5         0       3  ...   8.0500    NaN         S
..           ...       ...     ...  ...      ...    ...       ...
886          887         0       2  ...  13.0000    NaN         S
887          888         1       1  ...  30.0000    B42         S
888          889         0       3  ...  23.4500    NaN         S
889          890         1       1  ...  30.0000   C148         C
890          891         0       3  ...   7.7500    NaN         Q

[891 rows x 11 columns]

### `[handling missing vals]

In [28]:
titanic_df.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [29]:
len(titanic_df)

891

In [ ]:
#cabin is nominal data and non repetative so delete

In [30]:
titanic_data=titanic_df.drop(['Cabin'],axis=1)

In [31]:
titanic_data.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Embarked         2
dtype: int64

In [ ]:
#if missing data is continous - replace it with mean
#else if discrete- replace it with mean or mode#

In [33]:
titanic_data['Age'].median()

28.0

In [34]:
titanic_data['Age'].sort_values().unique()

array([ 0.42,  0.67,  0.75,  0.83,  0.92,  1.  ,  2.  ,  3.  ,  4.  ,
        5.  ,  6.  ,  7.  ,  8.  ,  9.  , 10.  , 11.  , 12.  , 13.  ,
       14.  , 14.5 , 15.  , 16.  , 17.  , 18.  , 19.  , 20.  , 20.5 ,
       21.  , 22.  , 23.  , 23.5 , 24.  , 24.5 , 25.  , 26.  , 27.  ,
       28.  , 28.5 , 29.  , 30.  , 30.5 , 31.  , 32.  , 32.5 , 33.  ,
       34.  , 34.5 , 35.  , 36.  , 36.5 , 37.  , 38.  , 39.  , 40.  ,
       40.5 , 41.  , 42.  , 43.  , 44.  , 45.  , 45.5 , 46.  , 47.  ,
       48.  , 49.  , 50.  , 51.  , 52.  , 53.  , 54.  , 55.  , 55.5 ,
       56.  , 57.  , 58.  , 59.  , 60.  , 61.  , 62.  , 63.  , 64.  ,
       65.  , 66.  , 70.  , 70.5 , 71.  , 74.  , 80.  ,   nan])

In [35]:
import numpy as np
titanic_data['Age'].replace(np.nan,titanic_data['Age'].median())

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888    28.0
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [36]:
import numpy as np
titanic_data['Age'].replace(np.nan,titanic_data['Age'].median(),inplace=True)

In [37]:
titanic_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       2
dtype: int64

In [40]:
titanic_data.dropna(inplace=True)

In [41]:
titanic_data.isnull().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Embarked       0
dtype: int64